Autodesk.Navisworks.Api.Point2DList
List of 2D points.

Autodesk.Navisworks.Api.Point2DList.#ctor
Creates an empty list

Autodesk.Navisworks.Api.Point2DList.Add(Autodesk.Navisworks.Api.Point2D)
Adds a point to the back of the list
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentException:
Argument 'point' has been Disposed

Autodesk.Navisworks.Api.Point2DList.IsReadOnly
Gets a value indicating whether the object is read-only.